ppvision/PicoXTools/components/lr11xx/apps/gnss/gnss_assisted/utils_stm32l4.c
/*!
 * @file      utils_stm32l4.c
 *
 * @brief     Implementation of utility functions required for GNSS assisted on top of STM32L4 MCU
 *
 * The Clear BSD License
 * Copyright Semtech Corporation 2022. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the disclaimer
 * below) provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the Semtech corporation nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT
 * NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SEMTECH CORPORATION BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include "utils_stm32l4.h"
#include <stddef.h>
#include "stm32l4xx.h"
#include "smtc_hal_mcu_timer.h"
#include "smtc_hal_mcu_timer_stm32l4.h"

/*
 * -----------------------------------------------------------------------------
 * --- DEPENDENCIES ------------------------------------------------------------
 */

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE MACROS-----------------------------------------------------------
 */

#define TIMER_PERIOD_MS ( 1000 )

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE TYPES -----------------------------------------------------------
 */

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE CONSTANTS -------------------------------------------------------
 */

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE VARIABLES -------------------------------------------------------
 */

volatile static uint32_t         counter_s  = 0;
static smtc_hal_mcu_timer_inst_t timer_inst = NULL;

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DECLARATION -------------------------------------------
 */

/**
 * @brief Handler called on timer expiration
 */
static void timer_expiration_handler( void );

/*
 * -----------------------------------------------------------------------------
 * --- PUBLIC FUNCTIONS DEFINITION ---------------------------------------------
 */

bool init_timer( void )
{
    const struct smtc_hal_mcu_timer_cfg_s cfg         = { .tim = LPTIM1 };
    const smtc_hal_mcu_timer_cfg_app_t    cfg_app     = { .expiry_func = &timer_expiration_handler };
    smtc_hal_mcu_status_t                 init_status = smtc_hal_mcu_timer_init( &cfg, &cfg_app, &timer_inst );
    smtc_hal_mcu_timer_start( timer_inst, TIMER_PERIOD_MS );
    return ( init_status == SMTC_HAL_MCU_STATUS_OK );
}

uint32_t get_time_s( void )
{
    return counter_s;
}

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DEFINITION --------------------------------------------
 */

static void timer_expiration_handler( void )
{
    // It simply increases the local counter, and restart the timer
    counter_s++;
    smtc_hal_mcu_timer_start( timer_inst, TIMER_PERIOD_MS );
}